### DataFrame과 리스트,딕셔너리,넘파이 ndarray 상호 변환

In [2]:
import numpy as np
import pandas as pd
col_name1=['col1']
list1=[1,2,3]
array1=np.array(list1)
print('array1 shape:',array1.shape)
df_list1=pd.DataFrame(list1,columns=col_name1)
print(df_list1)
#넘파이 ndarray를 이용해 DataFrame 생성
df_array1=pd.DataFrame(array1,columns=col_name1)
df_array1

array1 shape: (3,)
   col1
0     1
1     2
2     3

   col1
0     1
1     2
2     3

In [3]:
#3개의 컬럼명이 필요
col_name2=['col1','col2','col3']

#리스트
#2행x3열 형태의 리스트와 ndarray 생성한 뒤 이를 DataFrame으로 변환
list2=[[1,2,3],[11,21,31]]
array2=np.array(list2)
df_list2=pd.DataFrame(list2,columns=col_name2)
df_list2

   col1  col2  col3
0     1     2     3
1    11    21    31

In [4]:
#array
df_array2=pd.DataFrame(array2,columns=col_name2)
df_array2

   col1  col2  col3
0     1     2     3
1    11    21    31

In [5]:
#딕셔너리
#key는 문자열 칼럼명으로 매핑,value는 리스트 형 칼럼 데이터로 매핑
dict={'col1':[1,11],'col2':[2,22],'col3':[3,33]}
df_dict=pd.DataFrame(dict)
df_dict

   col1  col2  col3
0     1     2     3
1    11    22    33

### DataFrame을 넘파이 ndarray,리스트,딕셔너리로 변환하기

In [6]:
#DataFrame을 ndarray 로 변환
array3=df_dict.values
array3

array([[ 1,  2,  3],
       [11, 22, 33]], dtype=int64)

In [7]:
#DataFrame을 리스트로 변환
list3=df_dict.values.tolist()
list3

[[1, 2, 3], [11, 22, 33]]

In [8]:
#DataFrame을 딕셔너리로 변환
dict3=df_dict.to_dict('list')
dict3

{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

In [9]:
data={'Name':['Chulmin','Eunkyoung','Jinwoong','Soobeom'],'Year':[2011,2016,2015,2015],'Gender':['Male','Female','Male','Male']}
data_df=pd.DataFrame(data,index=['one','two','three','four'])
data_df

            Name  Year  Gender
one      Chulmin  2011    Male
two    Eunkyoung  2016  Female
three   Jinwoong  2015    Male
four     Soobeom  2015    Male

In [12]:
#data_df를 reset_index()로 새로운 숫자형 인덱스를 생성
data_df_reset=data_df.reset_index()
data_df_reset=data_df_reset.rename(columns={'index':'old_index'})
#인덱스 값에 1을 더해서 1부터 시작하는 새로운 인덱스값 생성
data_df_reset.index=data_df_reset.index+1
data_df_reset

  old_index       Name  Year  Gender
1       one    Chulmin  2011    Male
2       two  Eunkyoung  2016  Female
3     three   Jinwoong  2015    Male
4      four    Soobeom  2015    Male

In [17]:
data_df.iloc[0,0] ;data_df.loc['one','Name']

'Chulmin'

### apply lambda 식으로 데이터 가공

In [18]:
def get_square(a):
    return a**2
get_square(3)

9

In [19]:
lambda_square=lambda x: x**2
lambda_square(3)

9

In [20]:
a=[1,2,3]
squares=map(lambda x: x**2,a)
list(squares)

[1, 4, 9]